{
  "speakers": [
    {
      "id": "barbara-forbes",
      "name": "Barbara Forbes",
      "title": "Azure Architect @ Zure | Azure MVP | GitHub Star",
      "bio": "Barbara Forbes is an Azure Architect & consultant at Zure in the Netherlands, a Microsoft Azure MVP, Microsoft Certified Trainer (MCT), and a GitHub Star. She works at the intersection of technology, strategy, education, and development. Her focus is on the Microsoft Cloud Adoption Framework, Generative AI, Infrastructure as Code, PowerShell, and GitHub.\nBarbara loves explaining things in an accessible manner; in person, as a teacher for LinkedIn Learning and as a frequent speaker at conferences and user groups. She is actively involved in the tech community, including being part of the organization of European events",
      "photo": "https://sessionize.com/image/6fc2-400o400o2-4HzpJWG1Qpx8UKbt4xJRzr.jpg"
    },
    {
      "id": "geert-van-der-cruijsen",
      "name": "Geert van der Cruijsen",
      "title": "CEO Zure Netherlands",
      "bio": "Geert van der Cruijsen is the CEO of Zure Netherlands, helping companies improve how they build software by combining strong engineering culture with modern technology. He focuses on DevOps, cloud-native development, architecture and AI, enabling teams to work more autonomously and deliver faster through smart platforms and better ways of working. Geert is a long-time Microsoft MVP and an active member of the tech community, frequently sharing knowledge through talks, content and mentorship.",
      "photo": "https://sessionize.com/image/5f8b-400o400o2-JXXeFuFmNbuqSi4jDbcx7i.jpg"
    },
    {
      "id": "rik-hepworth",
      "name": "Rik Hepworth",
      "title": "Founder and CEO, Zure UK; Microsoft MVP (Azure); Microsoft Regional Director",
      "bio": "Rik helps organisations use Cloud better as CEO and co-founder of Zure UK. Whether that is a new adoption where governance and management are key, or an application modernisation project where technology choice and team knowledge are important factors in success.\nThrough his public speaking and community involvement, Rik is a recipient of the Microsoft MVP Programme award for his work with Azure. He is also proud to be a member of the Microsoft Regional Director Programme. As an event organiser, speaker and lapsed blogger, Rik is keen to share his knowledge with the community, and encourage and support others as they do the same.\nHis grey hair is an indication of how long he has worked in IT, and in that time he's done most things you'd expect of an IT Pro: From crawling under floors pulling cables, to managing large scale automated OS rollouts, to architecting solutions for on-premises and cloud. Now he spends more time working with his customers' management, sharing that breadth of experience and learning.",
      "photo": "https://sessionize.com/image/d672-400o400o2-K681tmuiJ9Be2QkUG9D37.jpg"
    },
    {
      "id": "jan-de-vries",
      "name": "Jan de Vries",
      "title": "Principal Azure and AI Architect at Zure",
      "bio": "I'm a passionate engineer, with over 20 years of experience designing and delivering innovative solutions.\nMy regular work centers on building reliable, scalable systems in Microsoft Azure and creating GenAI-powered solutions.\nI love working in complex environments, collaborating with customers, leadership, and engineering teams to design solutions that provide value on both short- and long-term.\nI regularly coach engineers and teams, helping both them and myself to grow.\nBeyond engineering, I'm keen on sharing knowledge. I write blog posts, speak at conferences, user groups, and actively engage with the tech community.",
      "photo": "https://sessionize.com/image/e68e-400o400o2-EhpcSv2qb58XNZUjhHVnZw.jpg"
    },
    {
      "id": "pasi-huuhka",
      "name": "Pasi Huuhka",
      "title": "DevOps Architect at Zure, DevTech MVP",
      "bio": "Pasi Huuhka is a Microsoft Azure MVP with a background spanning DevOps, full stack software development, architecture, and systems administration.\nSince 2013, he’s worked hands-on with a broad range of Azure’s platform-native, container-based and serverless offerings, helping over 150 customers - from startups to large enterprises - build and operate reliable, cloud-native solutions.\nToday, his focus is on SRE practices, DevOps, and modern application development on Azure, with a particular interest in AI-powered and agent-based systems. He's passionate about designing cloud architectures that not only work, but scale, self-heal, and evolve over time. He continues to learn by teaching others and actively contributing to the Azure community through Finland Azure User Group.",
      "photo": "https://sessionize.com/image/c8c9-400o400o2-NAkknZLCRnWd9yVZdiZctd.jpg"
    },
    {
      "id": "glenn-colpaert",
      "name": "Glenn Colpaert",
      "title": "Azure MVP | CTO at Zure Belgium",
      "bio": "Glenn Colpaert is co-founder and CTO at Zure Belgium. He is a Microsoft Azure MVP since 2014 and is a frequent speaker at national and international events.\nWith over 15 years of experience gained in many national and international projects, he can adapt quickly to customer-specific situations and scenarios.\nCurrently, he’s mainly focused on designing and building secure, scalable cloud-based solutions on Microsoft Azure.\nGlenn likes to share his experience with the community and is he's an active crew member of the Belgian Azure User Group (AZUG).",
      "photo": "https://sessionize.com/image/dce6-400o400o2-psZoLJNUkYk7aKtXjGeLZD.jpg"
    },
    {
      "id": "sakari-nahi",
      "name": "Sakari Nahi",
      "title": "CEO at Zure, Microsoft RD, AI & Azure MVP",
      "bio": "Sakari is the other founder and CEO of Zure, an Azure-focused company. He has been coding on .NET professionally since 2002. He's a dad of two, husband of one and likes roguelikes & text-based games. He's passionate about emerging technologies, distributed computing, and synergies thereof.\nSakari is also a Microsoft Regional Director, and AI+Azure MVP. He organizes Finland Azure User Group and casts a pod Ikkunastudio in Finnish. Zure designs, develops, and manages solutions on Azure, with offices in Finland, Belgium, Denmark, United Kingdom and Netherlands.",
      "photo": "https://sessionize.com/image/b637-400o400o2-4QjNTvqQfhV6KyzPe6HwU3.png"
    },
    {
      "id": "chris-van-sluijsveld",
      "name": "Chris van Sluijsveld",
      "title": "CTO Zure Netherlands",
      "bio": "Chris helps companies embracing the full potential of Cloud Technology. He is experienced in advising and implementing Cloud technologies for new and existing businesses. He enjoys the challenge of finding the best solution for the problem. In his spare time Chris enjoys playing the occasional digital or analog board game.",
      "photo": "https://sessionize.com/image/8ba9-400o400o2-H3v6euksgsVKCyf33FYVQ.jpg"
    },
    {
      "id": "samu-niemela",
      "name": "Samu Niemelä",
      "title": "Zure, Data Domain Lead",
      "bio": "Samu Niemelä is a seasoned data architect and Domain Lead at Zure, where he helps organizations turn messy data into modern, scalable platforms—mostly on Microsoft Azure, and occasionally with some strong opinions. With over a decade of experience, he’s wrangled technologies like SQL Server, Azure Synapse Analytics, Snowflake, and Microsoft Fabric. Samu lives in the liquorice capital of the world—Kouvola, Finland—with his family, lots of coffee, and surprisingly few debugging regrets.",
      "photo": "https://sessionize.com/image/24b0-400o400o2-HjD3jApSJMmt2Dhad1LwGX.jpg"
    },
    {
      "id": "joonas-westlin",
      "name": "Joonas Westlin",
      "title": "Azure Architect/Developer and Azure MVP at Zure Ltd",
      "bio": "Joonas has been working with Microsoft technologies as a hobby since the first version of .NET framework. Currently he works as a software developer at Zure, a company specializing in developing software on Microsoft Azure using its PaaS offerings. He is one of the 6 Azure MVPs in Finland. Joonas is currently the global #1 for Entra ID answers on Stack Overflow (and #6 for Azure overall).",
      "photo": "https://sessionize.com/image/141c-400o400o2-P6w5h8xehBaXvnMWJVUB7b.jpg"
    },
    {
      "id": "tommi-hovi",
      "name": "Tommi Hovi",
      "title": "Senior Cloud Security Consultant @ Zure",
      "bio": "Tommi is an Microsoft Cloud Security generalist with cloud architect background. Core strengths are in identity security, modern authentication, device security, cloud governance, cloud security and detection engineering.\nHe has done various IT-jobs before landing on a spot at public cloud which carried away instantly at the beginning of 2019. He's been part of large cloud migration projects to greenfield deployments to security assessments and cloud consultation.\nTommi is an organizer in a Helsinki and Tampere-based Azure and Friends user group which arranges monthly in-person events and he authors a blog site tommihovi.com where he posts various cloud and identity security articles.",
      "photo": "https://sessionize.com/image/52fb-400o400o2-f1y5ZYbZ1x3BrTjsUEquTu.png"
    },
    {
      "id": "pieter-vandenheede",
      "name": "Pieter Vandenheede",
      "title": "Chief Architect, Founder Zure Belgium, MCT",
      "bio": "Pieter Vandenheede is the chief architect and founder of Zure Belgium.\nHe is specialized in Azure cloud architecture and cloud-native development.\nPassionate about tech, sci-fi, community, basketball and a father of 2, trying to bring all things together in a single mind, which sometimes succeeds :-)\nIn the past has spoken at conferences and user groups such as NDC, DevCon, AZUG, MIUG, VISUG and BTUG.",
      "photo": "https://sessionize.com/image/475e-400o400o2-KCNK35xWACoQewwP8AGo5t.jpg"
    },
    {
      "id": "ruben-delange",
      "name": "Ruben Delange",
      "title": "Azure Architect at Zure",
      "bio": "Ruben is a passionate Azure Architect at Zure. His job is to design and implement reliable, secure and scalable integration and back-end solutions in the Azure cloud. His focus is mainly on architecting and building Azure PaaS fit-for-purpose solutions.",
      "photo": "https://sessionize.com/image/13cc-400o400o2-sto9Ya5LfjZ4kU25d48UAF.png"
    },
    {
      "id": "markus-lehtola",
      "name": "Markus Lehtola",
      "title": "Data & AI Lead @ Zure",
      "bio": "Data & AI lead at Zure. Markus has long history in Azure Data & AI solutions with last year focus on Microsoft Fabric and dbt.",
      "photo": "https://sessionize.com/image/d91d-400o400o2-EhBZJmdLbSCU6V2j4Qw4uu.jpg"
    },
    {
      "id": "joona-immonen",
      "name": "Joona Immonen",
      "title": "Cybersecurity enthusiastic",
      "bio": "Joona works as a cybersecurity consultant at Zure. He has had decade long passion on developing DevOps and DevSecOps practices in software development. Fifteen years of Azure has made him a true cloud specialist.",
      "photo": "https://sessionize.com/image/7c8c-400o400o2-Hgz3yATuUaoUAiyNZHP8s1.png"
    },
    {
      "id": "miska-kyto",
      "name": "Miska Kytö",
      "title": "Microsoft MVP | Cybersecurity & AI Professional",
      "bio": "Miska is a sharp and creative consultant with a solid background in cybersecurity, specializing in security operations and AI security. Currently working at Zure, he has experience in managing and developing security in both small and large environments, from Microsoft 365 to Azure. Miska is also a Microsoft MVP, having been awarded as the youngest MVP in Europe.",
      "photo": "https://sessionize.com/image/b169-400o400o2-WDdrKm3qyBr4tJWp476FeE.jpg"
    }
  ],
  "sessions": [
    {
      "id": "multi-agent-workflows-n8n",
      "title": "Building Multi agent workflows using N8N & Azure",
      "abstract": "N8N is an open source workflow tool that you can run locally, in your own cloud or as a SaaS solution. It makes it really easy to build workflows with many integrations. AI agents are a core concept in these workflows.\nThis session is covered with hands on demos of building your own multi agent workflows, connecting to MCP servers, using LLMs in Azure and all without writing any actual code.\nAfter this session you'll have the knowledge to create your own agentic workflows to make your life or work easier",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "developers-quest-ai",
      "title": "The Developers Quest: Staying relevant in the world of AI Development Agents",
      "abstract": "AI development agents are becoming more capable every day, and many developers are starting to wonder what that means for their future. In this session, we go on a developer’s quest to stay relevant in a world where AI can write code, review pull requests, and even reason about solutions. Instead of focusing on hype or fear, we tell a story about what really makes developers valuable and how that value changes when AI becomes part of the team. This is an honest look at the challenges ahead and an invitation to rethink our role, not by fighting AI, but by understanding where we still matter most.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "opencode-coding-agent",
      "title": "OpenCode: an open source coding agent with sovereignty in mind",
      "abstract": "OpenCode is a fully open source AI coding agent that works in your terminal, IDE, or desktop and lets you use any model you choose, including local models or cloud models from GitHub, Azure, and others. OpenCode does not store your code or context by default and is not tied to a single provider. You stay in control of where your data is stored and how it is used, which helps with privacy and sovereignty requirements. In this session we'll show how developers can use OpenCode to have agents help design and build applications while keeping control over their data and tooling.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "model-context-protocol",
      "title": "Connecting AI agents to your systems using the Model Context Protocol",
      "abstract": "The Model Context Protocol (MCP) is a new open standard to connect AI agents with external tools and data. It makes it possible for agents in your applications or in your development process to work with APIs, databases, and services in a structured way. In this session we explain what MCP is and how it supports building useful agents for software teams. We will also show step by step how to build your own MCP server using .NET and C#, so you can bring custom functionality into your own AI agents.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "platform-engineering-workshop",
      "title": "Build a cloud native engineering platform in a day",
      "abstract": "Building and running software in the cloud can overwhelm developers with many tools and settings. Platform engineering fixes this by giving teams one open-source, cloud native platform that hides the hard parts and offers ready-made golden paths. This approach lowers cognitive load and helps developers ship faster.\nSelf-service platforms are on the rise and a lot of companies are building them from scratch hoping their developers will come and use it. We believe you can use existing open-source tools to compose a platform and spend your time designing the services you want to offer to your developers.\nIn this full-day workshop you will build such a platform, starting on a small local Kubernetes cluster and finishing on Azure, setting up the groundwork so you can take the lessons back to your workplace to focus on implementing the services that your company needs.\nWhat we will cover:\nBuild a cloud native internal engineering platform with CNCF projects & Kubernetes clusters created locally for zero-cost experiments, then repeated on Azure Kubernetes Service for real world scale.\nAdopt GitOps with Argo CD so the cluster always follows what is in Git, giving safe and fast releases.\nLearn about tools such as Azure Service Operator, Crossplane, Terranetes & KRO and how they can help you design automated self-service scenarios.\nCreate golden path templates that let a developer generate a new service repo, pipeline, and manifests in one click.\nShow a clear return on investment and gather facts you can use to convince leaders to fund a platform team.\nDeploy a service from commit to traffic and watch every step in the portal and GitOps dashboard, proving the value in minutes.\nLearning objectives:\n- Learn how platform engineering can cut developer cognitive load by providing a single self-service engineering platform.\n- Automate build and release with GitOps, kubernetes & Argo CD.\n- Learn to navigate the CNCF landscape regarding platform engineering with tools like Argo, Crossplane, Backstage, Azure Service Operator, Terranetes & KRO\n- Build a short business case that secures support for a platform team in your company.\nPrerequisites\n- A laptop that can run Docker\n- A GitHub account\n- Basic command-line knowledge\n- An Azure Account you can use\n- Any existing Kubernetes knowledge would speed things up but is not required",
      "speakerIds": [
        "geert-van-der-cruijsen",
        "chris-van-sluijsveld"
      ]
    },
    {
      "id": "sovereign-cloud-azure",
      "title": "Sovereign cloud on Azure: reducing risk and staying in control",
      "abstract": "Governments and organisations across Europe are questioning how to use hyperscalers like Azure while staying compliant and in control. What are the real risks, and how can we reduce them without giving up cloud benefits?\nThis session looks at legal and technical challenges of using US-based cloud providers in the EU. We will cover Azure capabilities like confidential computing, customer-managed keys and sovereign landing zones, and show how architecture choices can improve flexibility.\nAnd don’t worry, it’s not just legal talk. We will also show practical technical decisions that help you stay in control and keep risks manageable, whether you are building apps or advising on strategy.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "ai-agents-mcp-semantic-kernel",
      "title": "AI agents in action: tool execution using MCP with Semantic Kernel",
      "abstract": "AI agents are evolving from text-based assistants into systems capable of performing real-world tasks. The Model Context Protocol (MCP) is an open standard that allows AI models to interact with external tools, data sources, and services through a common interface.\nIn this session, we will explore how MCP enables AI agents to execute actions beyond their initial context. We will demonstrate how to implement MCP in agents built with Semantic Kernel using C#, and how these agents can use tool calling to complete tasks. We will also touch on how MCP fits into the Azure AI Agent Service and how it supports scalable, secure agent design in enterprise scenarios.\nAttendees will learn how to:\n- Connect AI agents to external tools and data sources using MCP\n- Implement MCP in Semantic Kernel agents with C#\n- Use Azure AI Agent Service to run agents securely at scale\nThis session is intended for developers and architects interested in building AI agents capable of performing actions in the real world.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "platform-adoption",
      "title": "No, I don't want to use your platform!",
      "abstract": "You've built an amazing internal developer platform, but developers aren't using it. This session explores why platforms fail to gain adoption and how to design platforms that developers actually want to use. Learn about developer experience, golden paths, and measuring platform success.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-137070",
      "title": "10 CNCF projects every Azure engineer should know",
      "abstract": "The Cloud Native Computing Foundation (CNCF) hosts a overwhelming number of projects, making it challenging to identify the ones that truly matter for Azure Engineers. In this session, we’ll highlight 10 essential CNCF projects that every Azure-focused professional should know. These tools are invaluable for building scalable, resilient, and efficient cloud-native solutions on Azure. Whether it’s managing Kubernetes, automating deployments, or enhancing observability, this session provides insight in how these projects can streamline your workflows and enhance your impact as an Azure engineer.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-137072",
      "title": "Making your existing applications ready for AI agents integration",
      "abstract": "AI agents are getting better at completing full business tasks & processes. But they need a way to work with your existing business applications & data.\nThis session shows you to get your current business applications ready for this. Using Model Context Protocol (MCP), you can make your current .NET APIs and Azure Functions available to AI agents with minimal changes. You will see how to extend your application so agents can ask questions, take actions, and work with your data.\nWe will walk through the theory of how works, talk about pitfalls & patterns and the session is full of demos showing you how to get your current application ready to connect with AI systems.\nAfter this session you'll have some clear steps of making your own business applications ready to be interacted with by AI Agents",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-137071",
      "title": "Letting agents control your webbrowser. What could go wrong?",
      "abstract": "2025 is the year of Agents. Last year, we mostly built applications that created text or searched through your business data with RAG. Now, we're giving generative AI more power by using agents. What makes agents different is their ability to perform tasks or run actions themselves.\nIn this talk, we'll look at one specific agent as an example: an agent that uses a web browser just like a human would. While a browser agent can be a powerful tool in your AI agent toolbox, the principles you'll learn from this agent can apply to connecting any kind of system, service, or API.\nWe'll talk about a new protocol called MCP (Model Context Protocol), explaining how it enables seamless connections between AI agents and virtually any system or API.\nIn this session you'll learn to understand the broader application of MCP for agent integration or making your own applications MCP ready, and discover when it's smart to use these agents, when you shouldn't, and what could possibly go wrong.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-124768",
      "title": "No, I don’t want to use your platform!",
      "abstract": "Engineering platforms promise to simplify workflows, accelerate delivery, and empower teams, but what happens when the very users they’re designed for actively resist adopting them? Beneath the frustration lies a powerful truth: platforms often fail because they’re built with good intentions but miss the mark on developer needs.\nIn this session, we’ll explore platform adoption from the user’s perspective, unpacking the key reasons why engineers might reject a platform. From rigid workflows and poor developer experience to a lack of trust or misaligned incentives, we’ll examine the real-world friction points that prevent success.\nAttendees will gain practical insights into how to better understand user needs, foster collaboration between platform teams and developers, and make iterative improvements that address real-world challenges. This session will provide a view on building platforms that engineers genuinely find useful and want to adopt.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-124767",
      "title": "Life After Code: Developers in a Post-AI World",
      "abstract": "AI is already handling many development tasks, but while it’s not yet capable of fully replacing developers, it’s evolving quickly. What happens when AI takes over most software development? This session looks forward to the future of the developer role in a post-AI world.\nWith coding largely automated, we’ll consider how the role of developers may evolve and what skills will be most valuable in this new era. Together, we’ll envision what the future might hold and how developers can adapt to remain impactful in an AI-driven industry.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-124766",
      "title": "How to Get Your Dev Team Playing at Champions League Level",
      "abstract": "Great teams don’t win by accident. They build trust, communicate clearly, and keep improving together. Software development is a team sport. Talent matters, but how people work together matters even more.\nIn this talk, we look at what helps teams grow. Topics include roles, leadership, feedback, goal-setting, and how company culture supports strong teamwork. Whether you lead a team or are part of one, this session will give you ideas to help your team play better together.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-124765",
      "title": "Accelerating Cloud-Native and AI Development with Azure Container Apps",
      "abstract": "Azure Container Apps makes it easier than ever to build and run modern cloud-native and AI-powered applications. Whether you're deploying web services or AI workloads, this fully managed platform takes the complexity out of scaling and managing containers.\nIn this session, we’ll show you how to get started with Azure Container Apps through hands-on demos. You’ll see how to build and deploy applications while exploring the AI capabilities that make this platform stand out. Join us to learn how Azure Container Apps can simplify your workflow and accelerate your development process.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-124764",
      "title": "Building Cloud-Native Self-Service Platforms on Azure",
      "abstract": "Platform Engineering is changing how organizations enable their teams to work efficiently and effectively. Self-service platforms are a key part of this, allowing teams to build, test, and deploy with minimal friction.\nIn this session, we’ll focus on building these platforms using cloud-native technologies to help you get started quickly. You’ll learn practical steps and strategies to define key capabilities, select the right tools, and leverage the cloud to create scalable, developer-friendly platforms. If you’re ready to empower your teams and accelerate their workflows, this session is for you.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-124763",
      "title": "Building an engineering culture that works",
      "abstract": "A strong engineering culture helps teams work faster, smarter, and more effectively. This session focuses on the Eight Pillars of Engineering Culture, which can help any organization tackle key bottlenecks and create a better way of working.\nWe’ll share practical advice on improving teamwork, building scalable platforms, and fostering a culture of innovation and learning. If you want to unlock your team’s full potential and make lasting changes, this session is for you.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-105055",
      "title": "The Past, Present and Future of Gen AI",
      "abstract": "Generative AI, while a new and rapidly evolving field, has already shown significant potential for business transformation. In this session, we will explore the three key levels of Generative AI: Clever Prompting, Context Enriched Generative AI, and Connected Autonomous Agents.\nWe'll discuss how we have progressed from the initial stages to more advanced implementations and look ahead to future possibilities.\nGeert will show you practical examples & code on setting your first steps into sprinkling some generative AI on your applications to building fully autonomous agents.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-93757",
      "title": "Automating complex cloud test environments on demand at scale @ ASML",
      "abstract": "At ASML we build the most complex machine in the world. This machine also needs software to run and has a platform to communicate with the outside world. Next to hardware teams, we have hundreds of teams working on the software and we want to make their life easier in testing and qualifying their software for actual releases into the factories at customers where our machines run in production.\nManaging these complex test environments can be a pain especially if you have to do this at the scale we operate on at ASML (Think thousands of devs and then thousands of VMs). In this session we’ll discuss some of the concepts of how we use the power of the cloud to dynamically spin up test clusters on demand at scale on multiple clouds meeting demands from both developers & our security department.\nJoin us to uncover the principles, strategies, and technologies that make it possible to automate and scale complex cloud test environments on demand. Discover how these advancements can empower your teams, streamline your operations even if you’re not working on the most complex machine in the world.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-93658",
      "title": "The AI Ensemble: Orchestrating AI Agents with .NET & Orleans",
      "abstract": "Building generative AI solutions can be split into 3 levels, starting with clever prompting to add some LLM magic to your application towards the second level where you add capabilities on your own data. The third level introduces the paradigm of connected agents - autonomous entities that communicate and collaborate to achieve complex goals.\nThis session will delve into the details of building AI applications at this advanced tier, utilising the robust capabilities of Microsoft .NET & Orleans. Microsoft Orleans, with its Actor model foundation, emerges as a particularly effective framework for orchestrating the interactions of these agents.\nBy leveraging the .NET ecosystem, developers can craft scalable, resilient AI-driven solutions that fully exploit the potential of connected agents, setting a new standard for intelligent applications.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-85789",
      "title": "Unleashing AI's Potential with Azure: A Hands-On Exploration for Software Developers",
      "abstract": "Dive into the world of Artificial Intelligence on Azure in this comprehensive, full-day workshop designed for software developers. Whether you're just starting out or looking to deepen your understanding, this workshop offers a unique opportunity to explore Azure's AI capabilities.\nParticipants will gain foundational knowledge about the vast possibilities within Azure's AI landscape. The workshop covers a range of topics including Azure AI Services (formerly Cognitive Services), Azure OpenAI, Azure Machine Learning, and Prompt Flow.\nTopics covered:\n- Azure AI Services\n- Azure OpenAI Studio\n- GPT 3.5, 4 and other models, which to use when\n- Azure AI Studio\n- Prompt engineering\n- Azure Machine Learning prompt flow\n- Azure cognitive search\n- Azure Document Intelligence Service\n- Azure AI Search\nThis interactive workshop combines theoretical insights with hands-on labs, providing a balanced learning experience while making a lot of fun!\nPrerequisites:\n- A laptop capable of installing software\n- A GitHub account for cloning hands on labs\n- Visual Studio Code pre-installed\n- preferably bring your own Azure OpenAI Key\nThis workshop is designed for software developers of any skill level, although some prior experience with Azure will be beneficial.\nJoin us to unlock the power of AI with Azure and take your skills to the next level!",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-85787",
      "title": "Building AI first applications using Semantic Kernel & C#",
      "abstract": "Semantic Kernel is an open-source SDK by Microsoft to build AI First applications and AI agents. Enabling developers to seamlessly integrate existing code with AI models from OpenAI, Azure OpenAI, and Hugging Face.\nThis talk explores the role of Semantic Kernel in AI orchestration, giving you the capabilities to create copilot-like experiences. We will showcase how Semantic Kernel empowers developers to build intelligent agents effortlessly, facilitating the automation of complex tasks by combining AI-generated responses with diverse programming languages. With Semantic Kernel, you can even allow an LLM to create a complex plan that can be executed locally, going far beyond what you might think LLMs can do.\nThe talk also highlights Semantic Kernel's extensibility, allowing the integration of memories, AI models, and plugins, making it a key player in the landscape of AI development.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-85203",
      "title": "Sustainable Software Engineering; Coding For a Greener Tomorrow",
      "abstract": "In our increasingly digital era, the ecological footprint of technology and software development is a critical yet often overlooked concern. In this session, we will demonstrate how to redefine the paradigms of software engineering through the lens of sustainability & the impact software has on our world.\nAttendees will gain insights into the principles of Sustainable Software Engineering, an emergent discipline that incorporates environmental thinking into each stage of the software development lifecycle. We will delve into practical, actionable strategies, demonstrating how to build greener, more energy-efficient applications without compromising functionality or innovation.\nJoin us to embark on a mission to save the world - one line of code at a time. Let's create software that drives human progress and respects and preserves our precious planetary resources.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-85202",
      "title": "Responsible AI: With great power comes great responsibility",
      "abstract": "AI is taking a larger footprint in our industry every day. It’s time to think about ethical considerations and the impact of AI done wrong or good can have in the AI landscape and on our society. In this session we’ll talk about AI decision-making processes and their broader impacts on individuals, society, and businesses.\nWith real-life examples and actionable steps, discover how to implement Responsible AI practices within your organisation. Explore the role of leadership in fostering a culture of Ethical AI and ensuring that the great power of AI is met with a heightened sense of responsibility. Join us in this session that equips developers and IT leaders to navigate the evolving landscape of AI with ethical clarity and strategic insight.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-85200",
      "title": "DevOps ❤️ Platform Engineering",
      "abstract": "Discover the synergy between DevOps and Platform Engineering in this session that explores their shared mission of accelerating business value delivery. Platform Engineering, the new kid on the block, aims to achieve similar outcomes as DevOps, often causing misconceptions of competition. This talk sheds light on the true nature & goals of Platform Engineering and how it can be the missing link in making DevOps teams even more productive. By seamlessly integrating Platform Engineering in DevOps and SRE practices, we unlock new dimensions of productivity, scalability, and reliability.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-85201",
      "title": "5 Common Platform Engineering Mistakes",
      "abstract": "Platform engineering plays a critical role in making developers more productive and delivering business value while maintaining security and compliance. However, it's not uncommon for platform teams to become bottlenecks that impede progress rather than driving it forward.\nJoin us for this session as we explore the top 5 common mistakes in platform engineering that can lead to inefficiencies and bottlenecks. We'll examine practical strategies for avoiding these mistakes and building a high-performing engineering department that delivers results while ensuring security and compliance. Whether you're an experienced platform engineer, just starting out or a engineering working with a platform team, you'll leave this session with valuable insights for enhancing your Organization’s productivity and effectiveness.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-71319",
      "title": "Azure Platform Engineering: What, why and how?",
      "abstract": "Platform engineering is a new hype in the software engineering landscape in the same space as DevOps, Agile & SRE. Is Platform engineering the new silver bullet to make everything work better?\nIn this session Geert will explain what Platform Engineering is, why there is a need for it and how it compares to DevOps & SRE. He'll give you a good overview and starters on how to implement this yourself in your organization to improve productivity, governance & security on Azure",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-71318",
      "title": "Azure Container Apps: Advanced features",
      "abstract": "Kubernetes is a popular choice for building cloud-native applications, but managing it can be a challenge. Fortunately, Azure Container Apps offers a serverless PaaS abstraction over Kubernetes that delivers many of the same benefits without the hassle of managing Kubernetes itself.\nJoin us for this session as we explore the advanced capabilities of Azure Container Apps for building advanced cloud-native solutions. We'll cover essential topics such as zero downtime deployments, high availability, and dynamic scaling up and down to zero, among others. With practical examples and tips, you'll learn how Azure Container Apps can be a really good alternative to Kubernetes when building cloud-native applications.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-61054",
      "title": "Building Microservice applications using .Net on Azure Container Apps",
      "abstract": "Kubernetes has all the hype but do you actually need all this complexity for your distributed application? There is a big trend happening by cloud providers to provide all the features Kubernetes brings without the complexity and Azure Container Apps is Microsofts take at this.\nIn this workshop you'll learn how you can build and deploy containerized applications using Azure Container apps from scratch using .Net.\nIt includes all the nice features it brings such as blue/green deployments, Dapr & autoscaling using Keda. Join this workshop to get ready to deploy your own microservice applications using Azure Container Apps",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-48617",
      "title": "Azure Container Apps: The Future of Microservices in Azure",
      "abstract": "Kubernetes has all the hype but do you actually need all this complexity for your distributed application? There is a big trend happening by cloud providers to provide all the features Kubernetes brings without the complexity and Azure Container Apps is Microsofts take at this.\nIn this Session Geert will talk you through how you can build and deploy containerized applications using Azure Container apps from scratch including all the nice features it brings such as blue/green deployments & autoscaling. Join us to see if this can be the future of Microservices on Azure.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-47403",
      "title": "Azure cloud governance for DevOps organizations",
      "abstract": "Azure.. Often seen as just another layer of infrastructure where you can apply the same governance as you did for your on premises infrastructure.\nIn this session Geert will prove you that to use the full speed and agility of the cloud you'll require a completely different approach that embraces DevOps and autonomous teams. Does this mean it will be less secure? Join this session to find out why it doesn't have to be less secure and how to create a cloud environment that both DevOps teams and security officers will love.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-47379",
      "title": "Overcoming your fears as a developer",
      "abstract": "Being a software engineer can be a great job with often cool challenges that brings joy to many. But for many developers either junior or senior there are also many fears. Fear of not being good enough, Fear of not knowing everything about a new technology that your company just embraced, Fear of breaking production and gaining a bad reputation within the company and many other fears.\nIn this talk Geert will discuss these different fears with you, the developers to see how you can overcome these fears and things like imposter syndrome both from the developer side but also how you and your organisation can help your colleagues overcome their fears. Join us for tips and stories from junior to senior developers that should be relatable for your past, present or future.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-47378",
      "title": "Better architecture without architects",
      "abstract": "As a developer, have you ever had to implement an architecture thought up by an architect not in your team? Have you worked in an environment where you needed to propose changes in a CAB? Do you have architects in your organization who don't code? If you answer yes to any of the questions this session is for you!\nIn this session Geert will talk about how DevOps organizations with autonomous teams work faster and build better architecture without the need of enterprise architects or complex processes before decisions are made. Come discuss the future of architecture with us in this session. Architects & Developers are welcome!",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-22397",
      "title": "Chaos Engineering: The fine art of breaking stuff in production on purpose",
      "abstract": "Have you ever been called out of bed because the high available system you run wasn't that high available as everyone thought? Or did you spend weekends doing manual fail over tests together with everyone in your team on standby?\nThese are things Chaos Engineering is trying to avoid. The idea of Chaos Engineering is that teams are in in control of their production environment. Being in control allows you to do experiments in production like killing servers, increase network latency or databases to see how your system is able to recover from it without impacting end users.\nIn this session we'll cover the basics of chaos engineering, practices of creating an architecture and system that allows for experimenting in production and how you can start doing this in your own environments.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-61057",
      "title": "A practical approach to Service Level Objectives",
      "abstract": "Service Level Objectives are a great way to embed quality & resilience into your software development lifecycle. But how do you start with this within your company?\nIn this session Geert will talk you through the why and what about Service Level Objectives (SLOs) & Service level Indicators (SLIs) and how you can start using them.\nCome join this session to learn about making resilient & high available software products real & measurable!",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-137073",
      "title": "Multi-agent architecture patterns in practice",
      "abstract": "Building AI agents is one thing. Getting them to coordinate effectively is something else. In this session, we’ll look at architecture patterns for designing multi-agent systems that can solve real business problems.\nGeert will show practical examples and live demos using C#, Microsoft Agent Framework, Azure AI Agent Service, MCP & n8n. You’ll see how agents can communicate, share context, and split responsibilities across workflows. We’ll discuss patterns that work, common pitfalls and how to get the best results of making AI Agents work together.\nThis session is for developers who already know the basics of AI applications and want to bring them into production with confidence.",
      "speakerIds": [
        "geert-van-der-cruijsen"
      ]
    },
    {
      "id": "sessionize-61013",
      "title": "GitHub Actions to deploy to Azure: Take it to the next level",
      "abstract": "A basic deployment to Azure from GitHub Actions can be set up in 10 minutes. And we will do that, to get the basics down. But let's take it a step further. How can you make sure a workflow runs as efficient and flexible as possible? What options do you have to make a connection? Can different Bicep templates interact with each other? How do you work with stages? How do you make the workflow act differently based on branch or pull request label? Can you implement manual approvals?\nIn this session we will start with the basic workflow and walk through these great options that GitHub has to offer to get your workflow to work for you.",
      "speakerIds": [
        "barbara-forbes"
      ]
    },
    {
      "id": "sessionize-97491",
      "title": "Secure access to your Azure environment: Let's count the ways",
      "abstract": "Azure's web-based access is incredibly convenient, allowing you to enter the portal from any device, anywhere. But this convenience isn't exclusive to you; it's also a potential gateway for those with malicious intent, trying to exploit your resources, data and budget. The consequences from a security breach can be huge.\nIn an era where digital protection is needed more than ever, navigating the security tools can be overwhelming. Some tools might slow down your processes. Is the added security worth the potential decrease in speed? Is it necessary?\nThis session is your guide through the security options available to cloud engineers. We'll explore MFA, PIM, JIT, VPN, PAW, and other three-letter abbreviations that stand between you and your Azure environment intruders. Discover modern tools that not only secure your Azure space but could also be used for on-premises access through Azure.\nBy the end of our journey, you'll have a blueprint for creating the most secure environment. You'll leave equipped to make informed decisions about which security measures are right for your setup. Let's secure your Azure landscape together.",
      "speakerIds": [
        "barbara-forbes"
      ]
    },
    {
      "id": "sessionize-97488",
      "title": "Make your company love PowerShell as much as you do",
      "abstract": "PowerShell is awesome. We all need PowerShell. Automate everything! Nothing can go wrong right?\nLet's talk about the darker site of PowerShell. At what point are we automating too much, or are solutions to good? Is it possible for code quality to be too high? It might be when perfect code translates to \"impossible to maintain\". A perfect way to make sure your company gets to hate PowerShell quickly and efficiently.\nOnce we’ve had a laugh (and maybe a slight existential crisis), we’ll flip the script and dig into the real business value of PowerShell automation: where it shines, how to measure its impact, and how to make sure it’s saving time rather than creating more work. By the end, you’ll walk away smarter, sharper, and even more in love with PowerShell—this time, responsibly.",
      "speakerIds": [
        "barbara-forbes"
      ]
    },
    {
      "id": "sessionize-69323",
      "title": "The Microsoft Cloud Adoption Framework: What the Docs don’t tell you",
      "abstract": "The Microsoft Cloud Adoption Framework for Azure promises a flexible environment where developers have the freedom to innovate while keeping data and resources secure. Sounds great right? It is, but real life implementations can often come with some challenges. Including the first world problem of too much documentation.\nIn this session, we'll look at the Cloud Adoption Framework and how you can use it effectively. I will take your through each step of the Framework and the challenges that came with them in the real world implementations. Spoiler alert: It’s often not the technology that’s the problem! By the end of this talk you will have actionable knowledge to shape your own Azure journey to its fullest potential",
      "speakerIds": [
        "barbara-forbes"
      ]
    },
    {
      "id": "sessionize-61010",
      "title": "Coding in the Cloud: A guide to GitHub Codespaces",
      "abstract": "With GitHub Codespaces, you can enjoy coding effortlessly, straight from your browser! Use whatever device to write your code. No installation, no fuss. Codespaces are avaliable for everyone with a GitHub account for free. A great opportunity to get a better development experience, whether you are a developer or an operations expert.\nIn this session, I'll walk you through the ins and outs of Codespaces and show you how to create one from your GitHub repo. We'll cover a range of use cases, settings, and how to work with Visual Studio Code to get the most out of your Codespace. By the end of this session, you'll be all set to dive in and start using Codespaces with ease!",
      "speakerIds": [
        "barbara-forbes"
      ]
    },
    {
      "id": "sessionize-39320",
      "title": "Start using GIT for PowerShell",
      "abstract": "So you have been working with PowerShell. You hear a lot of people around you talking about GIT and you want to get into the game. But there are so many possibilities, you have no clue where to start. You're not a dev, you just write small scripts every now and then. Then this session is for you.\nDon't hesitate to bring your laptop in this workshop to getting started with GIT. We cover the absolute basics in a very practical way. In the end you will be able to use GIT for your own PowerShell scripts, as backup and version control.",
      "speakerIds": [
        "barbara-forbes"
      ]
    },
    {
      "id": "sessionize-44533",
      "title": "No cartoons in Azure: Creating a solid naming- and tagging strategy",
      "abstract": "Working with Azure brings a very familiar challenge: the naming convention. Who remembers inheriting servers named after cartoons, vegetables, scientists or random jokes? It's always funny until it starts scaling. With Azure, you reach this point very fast and it pays to get it right directly.\nIn this talk, we will look at the choices to make, the technical and strategical challenges and some tips & tricks from the field. Last but not least, let's see how we can integrate that naming- and tagging convention in our Infrastructure as Code to help get the most consistent environment. You will thank yourself later!",
      "speakerIds": [
        "barbara-forbes"
      ]
    },
    {
      "id": "sessionize-36969",
      "title": "Deploying to Azure: Azure DevOps Pipelines vs GitHub Actions",
      "abstract": "When using Infrastructure as Code, it’s crucial to maintain the highest possible quality and security of your code. Automated tests and deployments help us achieve a consistent and stable Azure environment.\nBut which tool should you use? Both Azure DevOps and GitHub Actions are professional tools to achieve this goal, but how do they compare? In this session, we will explore the similarities and differences between these two tools. How much time does it take to learn them, how much management do they require, and how do they integrate with Azure? Together, we’ll discover which of the two best fits your situation.",
      "speakerIds": [
        "barbara-forbes"
      ]
    },
    {
      "id": "sessionize-123906",
      "title": "Bicep: Build your first Azure template in minutes",
      "abstract": "If you're working with infrastructure as code and Azure, you've likely heard about Bicep. Still waiting for the right moment to dive in? Well, your opportunity has arrived!\nIn this session, I'll show you how Visual Studio Code can be of great help. Even with no experience at all, you will have templates ready to deploy in no time. We will start with the basics and then look through the awesome features that Bicep offers, from conditions and loops to modules.\nBy the end, you'll be just as thrilled as I am to get started with Bicep!",
      "speakerIds": [
        "barbara-forbes"
      ]
    },
    {
      "id": "sessionize-128757",
      "title": "Implementing Azure Policies: Before the Portal",
      "abstract": "As your Azure environment grows, you'll need to find ways to keep everything organized. Especially with structures like the Microsoft Cloud Adoption Framework, it's important to set boundaries to manage the endless possibilities that Azure has to offer. So you create policies to help maintain control, security, and compliance in your environment.\nBut where do you begin? The options seem endless. Should you use all of them?\nIn this talk, we'll look at the starting point. Guess what; it isn't the Azure portal. We'll see how to determine the policies you need and how to simplify your Azure experience rather than complicate it.\nWe'll also address common challenges and mistakes in Azure policy as seen from the field. At the end, you will have a clearer understanding that will help you make the best choices and make Azure policy work for you.",
      "speakerIds": [
        "barbara-forbes"
      ]
    },
    {
      "id": "sessionize-136095",
      "title": "Kickstart your secure Azure environment with Microsoft Defender for Cloud",
      "abstract": "In today's world, securing your cloud environment is more important than ever. We all need to find our way, but did you already explore what Microsoft Defender for Cloud has to offer? You get a suite of tools designed to protect your resources, detect threats, and respond to incidents swiftly. So many options, where do you start?\nJoin me in this session as I guide you along the different options of Microsoft Defender for Cloud. We'll start with an overview of its key features and capabilities, including threat detection, vulnerability management, and security posture assessment. Then, we'll explore practical scenarios and real-world examples to demonstrate how Defender for Cloud can help you create workflows to enhance security without compromising efficiency.\nThis session will provide insights and strategies to help you safeguard your Azure environment. Let's unlock the power of Microsoft Defender for Cloud together and ensure your cloud infrastructure stands strong against evolving threats.",
      "speakerIds": [
        "barbara-forbes"
      ]
    },
    {
      "id": "sessionize-146632",
      "title": "Coding smarter with GitHub Copilot",
      "abstract": "AI is changing the way we work. But how do we actually create more value with it?\nIn this session, we’ll see how GitHub’s AI-powered tools, like Copilot and Spark, can support every step of your workflow, from writing issues to shipping and maintaining production-ready code. You may have seen the highlights before, so we’ll focus on what matters: how to get consistently better results, instead of feeling like you’re explaining your code to a toddler.\nThrough live demos, we’ll explore how these GitHub tools can become your (slightly annoying) coworker. One that actually saves time, comes up with options you might miss, and occasionally surprises you in a good way.\nYou’ll walk away with a clear overview and practical tips on which tools and models to use.\nLet's find out how we can make AI work for us to bring our ideas to life.",
      "speakerIds": [
        "barbara-forbes"
      ]
    },
    {
      "id": "sessionize-152392",
      "title": "This title was written by AI — and that’s only the beginning",
      "abstract": "What happens when you let AI write your code, your posts, and your plans? Only one way to find out.\nIn this talk, I share what happened when I let AI take over my workflow: writing full coding projects, managing my LinkedIn presence, scheduling my time, creating videos, and even teaching me new frameworks.\nFrom hallucinated pull requests to surprisingly useful insights, each experiment revealed how much (and how little) we can delegate to machines. I will tell you my experiences and if I could have predicted them beforehand. You’ll leave with real examples, honest takeaways, and a new sense of how you can let AI help shape your life, without losing the human logic behind it.",
      "speakerIds": [
        "barbara-forbes"
      ]
    },
    {
      "id": "sessionize-136420",
      "title": "Multiagentic app architecture",
      "abstract": "In the last couple of years, development of AI applications has matured. As an industry, we have found some design patterns, and what's more, enterprises and business decision-makers have figured out sensible business use cases for LLMs.\nI've been part of over 30 GenAI cases during the last couple of years, and in this talk I will open the current state of AI application architectures, be they single or multi-agent.\nI will also look at what will happen next regarding ourselves (the technical designers and implementers) and organizations (who struggle with the governance, adoption and regulations of new technologies).\nAfter this talk, you will have an understanding of a multiagentic AI app architectures, why are they needed, and what could happen next the evolution of AI app architectures.",
      "speakerIds": [
        "sakari-nahi"
      ]
    },
    {
      "id": "sessionize-93760",
      "title": "State of GenAI-based development in Azure",
      "abstract": "GenAI is the largest hype. All products have AI, and all organizations are interested in it, with the highest levels of leadership demanding AI capabilities from the IT and development teams.\nYet, at the same time, there's only a limited number of meaningful software development projects with GenAI.\nWhy is this? What is going on? What is going to happen next? Where will we be next year?\nThis presentation explores the current state of GenAI development market, followed by practical AI projects and forecasting for what's next regarding this highly hyped and interesting field of GenAI.",
      "speakerIds": [
        "sakari-nahi"
      ]
    },
    {
      "id": "sessionize-70361",
      "title": "Modernization of HUGE legacy apps in Azure",
      "abstract": "We've all been there. There's a legacy codebase that's old enough to go to a bar, and \"surprisingly\" it has become such a big ball of mud that adding new features or fixing bugs has become very time-consuming and expensive. And irritating enough for some people to consider resigning.\nAt last the leadership team makes the decision - this big ball of mud needs to be modernized! Let's cloudify it, how hard can it be? The goal is to make the app more maintainable and easier to develop, as well as increase the user happiness. Maybe lower the runnings costs too!\nApp modernization, meaning \"modifying solutions to fit cloud\", has been and will continue to be one of the hot topics in any company's cloud strategy. Unfortunately, modernization projects tend to fail at least partially. This talk explores that failure.\nI have over 2 decades of experience from this field, and as a CEO of a development company, I get to talk about these issues a lot with leadership and development teams. This talk is aimed at decision-makers, developers, team leaders, and all stakeholders who are part of a modernization project. After this talk, you'll know what to do to make your modernization project succeed.",
      "speakerIds": [
        "sakari-nahi"
      ]
    },
    {
      "id": "sessionize-70358",
      "title": "Please, don't do microservices",
      "abstract": "Most big thinkers in our field agree: microservice architecture is rarely the correct choice. For 1/100 of projects, there might be a path forward with microservice architecture. Do you think your project is special enough to be that one? If you do, please attend this session.\nIn this session, not only will you come to understand microservices, you will also learn the pitfalls of the architecture as well as how to mitigate the risks and approach the creation of a microservice architecture.\nAfter this session, you will be able to identify the situation where microservice architecture is a viable choice to go forward. In addition, you will know how to actually go forward. The goal is that after this session, many of you will view microservices differently.",
      "speakerIds": [
        "sakari-nahi"
      ]
    },
    {
      "id": "sessionize-45832",
      "title": "Real-time design of an Azure PaaS app - Improv",
      "abstract": "In this session, you will see how a person with over 10 years of Azure PaaS and 20 years of software development experience designs a solution with Azure PaaS components. The promise is, you will have a broader view and understanding on the components and approaches used.\nThe session consists of 10 minutes of PaaS introduction, and the rest of the time of real-time design of an application with draw.io on the screen. The idea for the application is received from the audience, and nothing is decided before the session. The presenter talks their thinking and decision-making out loud, allowing you to follow his thinking his decision-making of Azure services.\nThis session is most applicable for developers and architects, but is followable for other roles, such as IT professionals and decision-makers, and can indeed give them a glimpse into what does it mean to be an developer/architect. The session is interactive, and audience is invited to share their opinion and extend the required features. The finalized design diagram is shared afterwards, including a description of core features. The session is about level 200.",
      "speakerIds": [
        "sakari-nahi"
      ]
    },
    {
      "id": "sessionize-45833",
      "title": "Modern Azure Data Platform",
      "abstract": "After this session, you will be familiar with the positioning, responsibilities, and relevant Azure tools for a modern, Azure-based data platform.\nData platform consists of several responsibility areas, such as integrations / IPaaS, APIs / API Management, ETL and IoT streaming pipelines, machine learning, and, of course, data warehousing and BI. In this talk, the presenter will present all of these areas and their responsibilities, including the relevant and most commonly used Azure services, with a decision-tree on what services to pick when.\nThis session is most applicable for enterprise and solution architects, data experts (engineers/scientists), and developers, but can also be mostly followed by IT professionals and decision-makers wishing to understand the cloud stack a bit better. The session is about level 250.",
      "speakerIds": [
        "sakari-nahi"
      ]
    },
    {
      "id": "sessionize-46221",
      "title": "Selecting the right Azure products for your Azure PaaS project",
      "abstract": "Microsoft Azure just keeps on growing. The amount of new releases during the year is alarming. In addition, many of the new products overlap with the old ones or with each other.\nThis talk gives you a quick overview of the meaningful differences between the Azure products commonly used when building a custom solution on top of Azure PaaS. The commonly used product consist of Azure App Services, Azure Functions, Azure SQL, Azure Cosmos DB, Azure Search, Azure Data Lake, Azure Redis Cache, Azure Service Bus, Azure Event Grid, Azure AD, Azure API Management and Application Insights. The talk is aimed at beginner and intermediate levels and those of us who have not had the time to broadly explore Microsoft Azure, with some bits at advanced level.",
      "speakerIds": [
        "sakari-nahi"
      ]
    },
    {
      "id": "sessionize-128510",
      "title": "Disruption is the job",
      "abstract": "15 years ago my friend and I founded Zure. This talk is about my view into our field as a developer-turned-CEO of an independent company in 5 countries.\nOur industry is facing a disruption in the form of AI. Our industry has faced other disruptions earlier, such as Internet, Mobile, Cloud, and others. Are disruptions a threat, or an opportunity?\nThe aim of this talk is to lessen your anxiety and increase your excitement, and if you happen to have FOMO or imposter syndrome, hopefully you'll have less of them after this talk.",
      "speakerIds": [
        "sakari-nahi"
      ]
    },
    {
      "id": "sessionize-140296",
      "title": "Improv: Let's design an Azure AI app together",
      "abstract": "In this session, we will design an Azure AI app live. The idea for an app can come from the audience. The requirement is that the idea has features that can be implemented with generative AI capabilities.\nIn the session, I will walk through my thinking on the topic while drawing the architecture together with the audience.\nThis session is most applicable for developers and architects, but is followable for other roles, such as IT professionals and decision-makers, and can indeed give them a glimpse into what does it mean to be an developer/architect. The session is interactive, and audience is invited to share their opinion and extend the required features.\nAt the end of the session, you will have an understanding of relevant Azure services as well as on the process of an architect in how they approach designing an app.",
      "speakerIds": [
        "sakari-nahi"
      ]
    },
    {
      "id": "sessionize-161680",
      "title": "Spec-driven development live",
      "abstract": "In this session, we will SDD something together. I'll ask you what, and then we will explore different ways of approaching vibecoding and SDD. The goal is to get as close as possible to proper coding. At the end of the session, we might not have something that compiles, but we will certainly have learned something.",
      "speakerIds": [
        "sakari-nahi"
      ]
    },
    {
      "id": "sessionize-30677",
      "title": "From a distributed monolith to a microservices solution",
      "abstract": "Are you creating a microservices solution? You sure about this?\nCreating small services that invoke other small services, which invoke even more smaller services most of the time results in a distributed monolith.\nUsing commands, events and loosely coupled services is something you SHOULD strive for!\nI'm happy to show you my lessons learned in this realm and which Azure services you can use to create a very scalable & responsive microservices solution.\nI'll quickly show you which services you should use, like Azure App Services, Azure Functions, Event Grid, and Storage Queues. With the short introduction out of the way, we'll dive into the details of these services, how to get the most out of them and when to use each service.\nAfter this session, you'll be aware of the pitfalls in a service-to-service design and know how to implement a proper, loosely coupled, microservices solution.",
      "speakerIds": [
        "jan-de-vries"
      ]
    },
    {
      "id": "sessionize-40453",
      "title": "Designing software in the cloud",
      "abstract": "Are you migrating to the cloud, or have you migrated already? Don't forget to update your software design also! Designing and developing software running on-premises often looks different compared to a cloud-native solution.\nYou can do a 1-on-1 migration of your software, and it will run fine*, but by leveraging a couple of standard cloud patterns, you can make the software more robust and cost-effective.\nI'll show you which steps I often take for migrating software to a cloud environment and which problems arise along the way. After this session, you'll have a clear understanding of what to do for a successful migration.",
      "speakerIds": [
        "jan-de-vries"
      ]
    },
    {
      "id": "sessionize-136282",
      "title": "Building an SDK to improve your API usage",
      "abstract": "Creating an API is just the first step. Making it easily usable by other teams, including your own, is crucial. Do you want them to struggle with figuring out how to interact with your API and potentially fail? Why not help them by providing a robust SDK?\nHaving worked with numerous backend systems over the past decades, I have experienced firsthand the time, frustration, and effort required to 'get it right.' Often, teams have created unique ways of invoking endpoints, have peculiar payload requirements, or have non-standard authentication requirements.\nYou can simplify the integration process for teams by providing an SDK in multiple programming languages if desired.\nIn this session, I will show you how to create an SDK with minimal effort. The key is to have your Open API specifications ready, and the rest can be automated.\nAnd to make it more fun, I will show you how to fine-tune the generated SDK to make it even more developer-friendly.\nBy the end of this session, you will know how to save your clients significant time and effort when they need to interact with your system.",
      "speakerIds": [
        "jan-de-vries"
      ]
    },
    {
      "id": "sessionize-152600",
      "title": "Get a knack for debugging",
      "abstract": "Debugging isn't just a skill, done right, it's a superpower. Yet somehow, it feels like many engineers are losing their grip on it. Whether it's a production meltdown or a mysterious local glitch, too often I see people poking around in the dark, hoping something sticks.\nIn this session, I'll bring the art of debugging back into the spotlight.\nAfter years of working with complex systems both on-premises and in the cloud, I've built up a toolkit, call it a gut instinct, for troubleshooting. It's not magic. it's knowing how services behave under the hood and how protocols tick gives you an edge when things go sideways.\nI'll cover practical strategies for debugging large systems, spotting patterns, and keeping your architecture resilient. And yes, with copilots and agents churning out more code than ever, your debugging skills are about to become even more valuable.\nExpect real-world stories, actionable tips, and a few laughs. Let’s help you get that knack for debugging, and maybe even enjoy it.",
      "speakerIds": [
        "jan-de-vries"
      ]
    },
    {
      "id": "sessionize-152606",
      "title": "Migrate your solution to modern standards",
      "abstract": "Did you lift-and-shift your way into the cloud, or are you running large compute clusters to keep an app running? If so, there’s a good chance you’re burning more money than you need to.\nHere’s the good news: you can probably optimize your workload and cut costs. Even better? You don’t have to reach for Kubernetes if you don’t want to.\nIn my day job, I come across all kinds of cloud-hosted solutions. Some are beautifully designed & implemented and a joy to work with. Others... not so much.\nThat's not a value judgement, both kinds often drive successful businesses. Still, there’s plenty of room to modernize without rewriting everything from scratch.\nIn this session, I’ll walk you through how to evolve less-than-ideal designs using patterns like the Strangler pattern, CQRS, Gateway Routing, and more. These approaches can help you migrate toward a cleaner, more scalable architecture. I’ll focus on Azure, but the principles apply across the board.\nLet’s make your solution leaner, smarter, and way more cloud-friendly.",
      "speakerIds": [
        "jan-de-vries"
      ]
    },
    {
      "id": "sessionize-160764",
      "title": "Build a generative AI solution that's delivering value",
      "abstract": "This is not a session about how great AI or LLMs are or if they are good or not at counting the number of r's in \"Strawberry\". It's about how I'm leveraging agents and language models in my current project to deliver value for our customers.\nIf there's one thing language models are good at, it's interpreting language and data. Especially if it's structured data with useful descriptions. In that sense, it's much like ourself.\nIn my project, we have a lot of structured, financial, data. We now need to do analysis on the data and make sure calculations are deterministic and always correct. That means I can't rely on the nondeterministic nature of a language model. By combining the Microsoft Agent Framework, Foundry agents, and a mix of .NET and Python components, I’ve built a high‑performing solution we can trust.\nYou'll leave the session knowing how to orchestrate agents and keep control over the accuracy & reliability. All based on my own experience working in the ecosystem.",
      "speakerIds": [
        "jan-de-vries"
      ]
    },
    {
      "id": "sessionize-152854",
      "title": "Multi-agent Orchestration patterns in Semantic Kernel",
      "abstract": "In this talk, we'll explore different orchestration pattern implementations provided by Semantic Kernel:\n- Sequential\n- Concurrent\n- Group Chat\n- Handoff\n- MagenticOne\nParticipants will learn what these patterns can do, when they should be used and how to implement them in C# code.\nTo get the most out of the presentation, participants should have basic knowledge of Semantic Kernel.",
      "speakerIds": [
        "pasi-huuhka"
      ]
    },
    {
      "id": "sessionize-139923",
      "title": "Security safeguards in continuous integration",
      "abstract": "Learn how to safeguard your software development project by implementing automated security checks in continuous integration pipeline. Learn what is behind acronyms like SAST, SCA, DAST, SBOM and SARIF.\nExamples are done with .NET, PowerShell and GitHub actions but are applicable to other tech stacks too.\nTopics:\n- How the GitHub Actions work\n- What is a good security test in continuous integration\n- How to analyse your code against defects\n- How to analyse your dependencies against known vulnerabilities\n- How to check your open source licenses\n- How to scan your code for secret leaks\n- How to scan your infrastructure as code for misconfigurations\n- How to generate bill of materials\n- How to check http security headers status from a website\n- Implementing branch guards\nPrerequisites:\n- Text editor\n- git\n- GitHub Account and Public repository\nTarget audience:\n- Security Engineers\n- Software Developers\n- Anyone interested",
      "speakerIds": [
        "pasi-huuhka"
      ]
    },
    {
      "id": "sessionize-99195",
      "title": "Passwordless App Infrastructures Utilizing Azure Managed Identities and Identity Federation",
      "abstract": "In this session, discover how to build passwordless app infrastructures using Azure Managed Identities and Identity Federation. We'll start with an overview of managed identities and identity federation, emphasizing their benefits and limitations. Learn to set up service principals in Azure DevOps and GitHub, backed by user-assigned managed identities, and release code / infrastructure changes using Azure Pipelines and Bicep.\nWe'll explore a typical PaaS Azure architecture and see how to configure these components to authenticate securely with each other using Azure RBAC without relying on passwords, eliminating the risk of credential expirations.\nWe'll also learn to configure Azure DevOps agents to use managed identities instead of PATs and integrate external secrets like API keys into your infrastructure. If time permits, we'll also cover a short example on Workload Identity in Kubernetes.\nJoin us to master the most secure and laziest way to configure your infrastructure. Say goodbye to passwords and credential management hassles, and hello to seamless, secure operations. It's a win-win!",
      "speakerIds": [
        "pasi-huuhka"
      ]
    },
    {
      "id": "sessionize-99204",
      "title": "HTMX, Tailwind CSS, and your favourite language: The Perfect Combination",
      "abstract": "As a seasoned backend developer and IT professional, the prospect of creating user interfaces has always been daunting, especially with the increasing complexity of state management and feature sets in popular libraries like React. However, the advent of tools like HTMX and Tailwind CSS has revolutionized UI development, making it accessible even for those who primarily focus on backend work.\nIn this presentation, we will delve into HTMX and how hypermedia is experiencing a resurgence. We'll demonstrate how to implement features with just a few HTML attributes, achieving in minutes what would typically require tens or hundreds of lines of JavaScript. Additionally, we'll explore Tailwind CSS, a utility-first CSS framework that simplifies styling by leveraging predefined classes. This approach drastically reduces the need for custom CSS, speeding up development and ensuring consistent design.\nWe'll conclude with a look at HTML-first component libraries like Shadcn-inspired FrankenUI and DaisyUI, showcasing how they can further streamline the UI development process. Whether you're a backend developer hesitant to venture into the front-end world or simply looking for more efficient ways to build UIs, this presentation will provide valuable insights and practical examples to enhance your workflow.",
      "speakerIds": [
        "pasi-huuhka"
      ]
    },
    {
      "id": "sessionize-99205",
      "title": "Optimizing Cloud Reliability with SLOs, SLIs, and Azure Workbooks",
      "abstract": "In today's cloud-driven landscape, ensuring reliable and high-performing services is crucial for business success. This talk delves into the essential concepts of Service Level Objectives (SLOs) and Service Level Indicators (SLIs), explaining their importance in maintaining service reliability and enhancing user satisfaction. We will explore how to identify key metrics, set achievable performance goals, and integrate these indicators into your operational workflows to drive continuous improvement.\nMoving beyond theory, we will provide a practical guide on creating your first set of SLIs, highlighting best practices for selecting relevant metrics, establishing realistic baselines, and implementing effective measurement strategies. The session will culminate with a demonstration of building actionable dashboards using Azure Workbooks. Attendees will learn how to leverage Azure's powerful tools for real-time monitoring, trend analysis, and troubleshooting, empowering them to proactively manage service performance and swiftly address issues. This comprehensive approach will equip participants with the knowledge and skills to enhance their cloud operations and deliver exceptional user experiences.",
      "speakerIds": [
        "pasi-huuhka"
      ]
    },
    {
      "id": "sessionize-136301",
      "title": "Cutting Through the CNCF Noise: 10 Must-Know Projects for Azure Engineers",
      "abstract": "Abstract:\nThe Cloud Native Computing Foundation (CNCF) landscape is vast and rapidly evolving, with hundreds of open-source projects vying for attention. For engineers working in the Microsoft Azure ecosystem, the challenge isn’t just keeping up—it’s identifying which tools actually move the needle in real-world cloud-native environments.\nThis session demystifies the CNCF landscape by focusing on 10 high-impact projects every Azure engineer should know. Whether you're managing Kubernetes clusters, streamlining CI/CD pipelines, enhancing observability, or securing infrastructure, these tools offer direct value and seamless integration with Azure-native services.\nFrom Helm to ArgoCD, Kyverno to OpenTelemetry, we’ll explore how each project fits into the Azure architecture, share practical implementation strategies, and provide actionable insights drawn from real-world use cases.\nTakeaways:\nDiscover which CNCF projects offer the highest ROI for Azure-centric environments\nLearn how to integrate these tools with services like Azure Kubernetes Service (AKS), Azure Monitor, and GitHub\nWalk away with concrete examples, implementation tips, and resources to deepen your expertise\nWho Should Attend:\nThis session is ideal for cloud architects, platform engineers, DevOps practitioners, and developers looking to sharpen their CNCF tooling and maximize the power of open source in Azure.",
      "speakerIds": [
        "chris-van-sluijsveld"
      ]
    },
    {
      "id": "sessionize-93511",
      "title": "Empowering Developers with a Modern Developer Platform",
      "abstract": "Abstract:\nIn today's fast-paced software development landscape, reducing the cognitive and operational load on developers is paramount to fostering innovation and accelerating product velocity. The paradigm of \"you build it, you run it\" has revolutionized team dynamics, enabling ownership and frequent, high-quality releases. However, it has also imposed significant burdens on developers, necessitating constant upskilling, broad cloud service proficiency, and meeting escalating product delivery expectations.\nThis session shows what role a modern developer platform in enhancing developer velocity and experience can have. Serving as a self-service hub a internal developer platform enhances efficiency, and promotes standardization, security, and compliance. By minimizing manual tasks and providing seamless integration using tools like AKS, ArgoCD, Crossplane, and Backstage, developers can focus on their core expertise — solving customer problems through code.\nAudience:\nThis session is tailored for software development leaders, architects, and practitioners seeking to optimize their development processes and empower their teams. It will benefit those interested in leveraging modern developer platforms to streamline workflows, enhance productivity, and elevate the developer experience. Whether you're involved in DevOps, cloud-native development, or software engineering management, this session offers valuable insights into harnessing platforms built on AKS, ArgoCD, Crossplane, and Backstage to drive innovation and accelerate product delivery.",
      "speakerIds": [
        "chris-van-sluijsveld"
      ]
    },
    {
      "id": "sessionize-90077",
      "title": "Modern authentication with Azure AD B2C",
      "abstract": "By moving user accounts away from applications and into an Identity Provider, we can use a single account on multiple systems and benefit from single sign-on.\nBut what can you do when your applications need to support multiple Identity Providers? And how can you develop a sign-in flow with the look and feel of your application? Or what if you need to add a fully customized sign-in experience? How do you debug it? And how can you build a CI/CD pipeline for this?\nIn this Developer focused session about Modern Authentication, we will show you how to tackle these challenges using AAD B2C.",
      "speakerIds": [
        "chris-van-sluijsveld"
      ]
    },
    {
      "id": "sessionize-29362",
      "title": "WORKSHOP: Build the distributed apps of the future using Dapr",
      "abstract": "Building distributed application is hard… As developers we want to focus on delivering business value with new features but there are so much things to also take care of on the side, especially in a distributed environment. Things as pub/sub, state management, bindings & triggers, service discovery, distributed tracing etc. Dapr tries to solve this problem by providing all of this to you so you can mix and match what pieces you want to use and also pick between many implementations of for example state management like cosmosDB, redis or dynamoDB\nIn this workshop you'll get hands on experience in building your own microservice based application using Dapr. You'll learn the following features of Dapr:\n• State management\n• Service discovery\n• Actor framework\n• Pub/sub\n• Distributed Tracing\nWe'll be building the application using several programming languages, Docker & Kubernetes. Basic knowledge of Docker & Kubernetes is advised to get the most out of this workshop.",
      "speakerIds": [
        "chris-van-sluijsveld"
      ]
    },
    {
      "id": "sessionize-29474",
      "title": "Azure API Management inside out",
      "abstract": "In this session Chris will explain how to use Azure API Management to expose your private workloads to 3th party's. Chris will explain the various parts of API management and show demo's on how to implement this inside of API Management.\nDemo's for example could be:\nAPI management and azure functions\nAPI management and OpenIdConnect\nAPI management and policy's to do the heavy lifting on security settings",
      "speakerIds": [
        "chris-van-sluijsveld"
      ]
    },
    {
      "id": "sessionize-157299",
      "title": "When Deployment Pipelines Aren’t Enough: CI/CD Patterns for Microsoft Fabric at Scale",
      "abstract": "Have you ever wondered how to bring proven software development CI/CD methods into Microsoft Fabric without losing governance? In large Fabric environments, the hardest problem is not deploying once—it is letting many teams deploy safely at the same time, with traceability, approvals, and clear ownership.\nIn this session, you will learn a practical CI/CD model for Fabric built on Azure DevOps, Fabric CLI, and the Fabric Python CI/CD package. We will show a scalable workspace and environment structure, a service principal access pattern based on least privilege, and a release process with gates that platform teams can enforce without slowing delivery. You will leave with a repeatable blueprint: a reference pipeline flow, a recommended repo and branching approach, and a checklist for permissions, promotion, and deployment controls that works across multiple domains and projects.",
      "speakerIds": [
        "samu-niemela"
      ]
    },
    {
      "id": "sessionize-161285",
      "title": "Drawing the Network Line: Workspace-Level Security in Microsoft Fabric",
      "abstract": "Microsoft Fabric makes analytics easy to start, but enterprise security teams still ask a simple question: what can connect to this workspace, and from where? This session brings clarity to inbound and outbound network traffic in Microsoft Fabric, using practical platform design patterns.\nThe session explains what inbound connections mean in a Fabric context, including user access, service APIs, and how clients reach Fabric workspaces. It then covers outbound connections, where Fabric workloads access data sources, Azure services, and external endpoints.\nNext, the session introduces a clear environment separation model. Development and test workspaces remain accessible from the public network to support fast iteration and self-service analytics. Production workspaces, however, are isolated using managed networks and private link.\nThroughout the session, we show how networking, identity, and workspace configuration must work together. You will leave with a clear understanding of inbound and outbound traffic flows and a practical option for designing secure, environment-aware Fabric platforms that meet both engineering and security requirements.",
      "speakerIds": [
        "samu-niemela"
      ]
    },
    {
      "id": "sessionize-137489",
      "title": "Orchestrating success: Comparing workflow technologies on Azure",
      "abstract": "Building and orchestrating workflows is a fundamental need in modern cloud applications, but with a wide array of tools and technologies available, selecting the right one for your use case can be challenging.\nIn this session, we’ll explore and compare popular workflow solutions including Azure Logic Apps, Durable Functions, Temporal, Elsa, MassTransit, NServiceBus, and Power Automate. Through side-by-side demos, we’ll showcase how each technology handles real-world scenarios, highlighting their strengths, limitations, and ideal use cases.\nAttendees will leave with a clear understanding of the trade-offs involved, helping them make informed decisions for their own workflow requirements.",
      "speakerIds": [
        "joonas-westlin"
      ]
    },
    {
      "id": "sessionize-45403",
      "title": "Deep dive into Azure Durable Functions",
      "abstract": "The Durable Functions extension to Azure Functions allows developers to build workflows using higher level abstractions. But what is really going on under the hood? It can be useful to know how all the pieces connect in case you are every trying to solve a trickier issue.\nIn this presentation, we will take a deep dive into the internals of the Durable Functions extension and the Durable Task framework. In addition to the default Azure Storage durability provider, we will look at the other officially supported providers and how they differ in their implementations.",
      "speakerIds": [
        "joonas-westlin"
      ]
    },
    {
      "id": "sessionize-137488",
      "title": "Decade on Azure: Evolution of Cloud Development",
      "abstract": "Take a step back in time and see how Azure has changed over the last ten years. In this session, you'll hear from an experienced Azure developer about the platform's growth from just a dozen services to hundreds today. We'll look at how Azure was ten years ago and discuss how it has evolved.\nYou'll learn details about some of the historical baggage still remaining in Azure. For example, why does App Service use \".azurewebsites.net\" as its URL? We'll also talk about big changes and services that are no longer around. There will also be some war stories where issues may have been partially caused by the older management experiences.\nThis session is for anyone who wants to understand Azure's past, make the most of its present, and get ready for its future.",
      "speakerIds": [
        "joonas-westlin"
      ]
    },
    {
      "id": "sessionize-45405",
      "title": "Building a document signing workflow using Durable Functions",
      "abstract": "Durable functions offer an interesting programming model for building workflows. Whether you need to sometimes split and do multiple things or wait for user input, a lot of things are possible. They do present some challenges as well, and the limitations of orchestrator functions can make working with Durable Functions seem very complicated.\nIn this talk we will go through the basics of Durable Functions along with strategies for deploying and monitoring them. A sample application will be presented where users can send documents for electronic signing. A Durable Functions workflow will power the signing process.\nAfter attending this talk, you will have a basic understanding of Durable Functions as well as the source code for the sample application, which you can refer to when developing your own applications.",
      "speakerIds": [
        "joonas-westlin"
      ]
    },
    {
      "id": "sessionize-83880",
      "title": "Securing a modern Web application with Entra ID",
      "abstract": "Adding OpenID Connect/OAuth authentication to a modern Web application can be hard. The authentication protocols are not simple. And some of the quirks of Entra ID don't make it any easier.\nIn this presentation, we will walk through what happens when you authenticate to a Web application using Entra ID authentication. Then we will add Entra ID authentication to a front-end single page application and its back-end API.\nWe will look at how to configure the Microsoft authentication libraries on both ends and what the critical settings are.",
      "speakerIds": [
        "joonas-westlin"
      ]
    },
    {
      "id": "sessionize-83879",
      "title": "Building a multi-tenant IoT data processing solution on Azure",
      "abstract": "Azure offers plenty of services for building Internet of Things solutions. Using them to build a highly scalable, multi-tenant solution presents many challenges however. How do you prevent one tenant from hogging all the resources? How do you deploy updates to the edge devices? How do you expand the solution to global scale? What do you do when your central data storage service gets deprecated?\nIn this presentation we will go through a real solution that our team implemented, the challenges we faced, and how we solved them. We will look at the basics of Azure IoT Edge, IoT Hubs, Event Hubs, and Azure Data Explorer.",
      "speakerIds": [
        "joonas-westlin"
      ]
    },
    {
      "id": "sessionize-83878",
      "title": "Avoiding absolutism in software development, experiences working as a consultant",
      "abstract": "Do not let perfect be the enemy of good. This is something I often have to repeat to myself and our customers. Typically it is best to come up with \"good enough\" solutions, instead of chasing perfection. As a consultant, I have worked with dozens of different organizations. Sometimes I meet people who push for perfection in security, processes, testing, user experience etc. While their purpose is the improvement of the solution, the value of going for perfection decreases as we go further. As our customers pay for the hours we work, I feel obligated to push back when someone tries to push for too much perfection. Sometimes the \"quick and dirty\" solution is the best solution, given the context.",
      "speakerIds": [
        "joonas-westlin"
      ]
    },
    {
      "id": "sessionize-27841",
      "title": "Zero Credential Development with Managed Identities for Azure Resources",
      "abstract": "Keys are always needed to access services in Azure and beyond. Storing and managing keys presents many problems, for example rotating and disabling them. Keys often also allow blanket access to the service with no way to limit it. Sometimes there is only one key that needs to be shared by services, so you won't have any way to disable access from one individually.\nIn this talk we will go through Managed Identities for Azure Resources, how they work, and how you can use them to use Azure services in a secure way without having to manage any keys yourself. We will go through a demo application which uses various Azure services through a managed identity, removing the need to use keys entirely.\nThe source code will be available to the audience so they have samples that they can use to implement managed identities in their own applications.",
      "speakerIds": [
        "joonas-westlin"
      ]
    },
    {
      "id": "sessionize-45401",
      "title": "Seriously securing an Azure PaaS application",
      "abstract": "What would it look like if we moved the security slider all the way to the max on an Azure PaaS application? If things like cost, developer productivity or ability to troubleshoot issues were not a problem, how far could we go? In this presentation, we are going to find out.\nA sample application is shown running in Azure App Service that is connected to data sources like Azure Storage and Azure SQL Database. Private endpoints, Azure Front Door, Azure Key Vault and various other services are also used. At the end of the presentation, cheaper and more practical options are also shown. The sample application source code and other files will made available to the audience.",
      "speakerIds": [
        "joonas-westlin"
      ]
    },
    {
      "id": "sessionize-45402",
      "title": "Using feature flags in an ASP.NET Core app on Azure",
      "abstract": "Larger features may take a long time to develop, but you still want to deploy production updates during development. Or maybe you want the users to be able to preview upcoming features? Either way, feature flags can resolve the issue.\nIn this presentation we take a look at using feature flags in an ASP.NET Core application running in Azure App Service. We use the Microsoft.FeatureManagement library to support both development-time feature flags and user-specific preview feature flags. The Azure App Configuration service's feature flag support is also explored. The sample application source code and other files will made available to the audience.",
      "speakerIds": [
        "joonas-westlin"
      ]
    },
    {
      "id": "sessionize-36715",
      "title": "UI testing Entra ID protected single page applications with Cypress",
      "abstract": "Authentication can make automated user interface testing complicated. The tests should use the application as it would be normally used, and that includes authentication. It can be even more complicated when the application uses a federated identity provider like Entra ID.\nIn this talk, you will see an approach to building UI tests with Cypress that test an Entra ID-protected single page application. The same approach can be applied to other testing frameworks as well. The source code of the presented application will be available to the audience.",
      "speakerIds": [
        "joonas-westlin"
      ]
    },
    {
      "id": "sessionize-60821",
      "title": "Real-time asset tracking with Azure: leveraging IoT, maps, and serverless technologies",
      "abstract": "Implementing high throughput event processing with Azure services presents many interesting challenges. A location tracking scenario adds its own challenges on top of those, such as dealing with coordinate systems and map services. Picking the right Azure services is important as is how they are configured and used.\nIn this talk we will look at a scenario that our team had to implement, the challenges it presented, and how we solved them using Azure services. We will go through a demo application that uses simulated GPS trackers and shows their real-time location on a map view. We will also look at possible optimizations and options.\nIn this talk we will look at the following Azure services: Event Hubs, Functions, SQL, Data Explorer, Maps, and SignalR Service.",
      "speakerIds": [
        "joonas-westlin"
      ]
    },
    {
      "id": "sessionize-127752",
      "title": "Managing and monitoring Microsoft Entra ID as Code - Is it worth it?",
      "abstract": "In a corporate world we've used to our identity provider being something that is constantly changing due to the need to manage identities, groups and other objects. This has been traditionally done via ClickOps or later semi-automated using PowerShell scripts.\nIn public cloud and in Microsoft Entra ID the same legalities apply. We still have most admins maintaining Entra ID from the Portal experience and some using PowerShell. What if there was another way to manage your tenant configuration? And monitor that it stays that way?\nIn this session I will challenge the audience to think unconventionally about managing Microsoft Entra ID, something that is typically done via 'point-and-click' method inherited from Active Directory management.\nTopics included are:\n- Pros and cons of different methods of Microsoft Entra ID management\n- Seeing if there is a use case for IaC based management\n- Can IaC-based management help with resilience and business continuity?\n- Technical walk-through of setting up IaC best practices for Entra ID tenant\n- Current limitations of the Bicep in Entra management\n- Monitoring for configuration changes\nIn the demo part I'm going to cover how to start managing your tenant as code and how to set up continuous monitoring.",
      "speakerIds": [
        "tommi-hovi"
      ]
    },
    {
      "id": "sessionize-127753",
      "title": "Better safe than sorry - Emergency Access Jacked Up in Microsoft Entra ID",
      "abstract": "Emergency Access (EA) in public cloud is paramount. It's might be your last string of hope to get your Microsoft tenant back. Recently Microsoft has made changes to portal and command line tool access requiring strong authentication. Emergency Access accounts (a.k.a Break Glass accounts) were subject to this change also. Stories from around the world about lost tenant access are horrifying. You might end up battling with support for months. How many companies can afford to lose at least part of their business for months? Or even weeks? Emergency Access is your insurance, but only if it's done the right way.\nIn this session I'll cover\n- What scenarios will get us locked out from tenant and when emergency access is to be used\n- How robust emergency access should be designed to cover all angles\n- How to monitor and secure these powerful accounts from credential abuse or privilege escalation\n- What processes are needed to create regarding emergency access\n- How to scale Emergency Access setup if company operations run on global scale\nWe all hope we never need to use emergency access, the same way we hope that we never actually need a seat belt in action, but when we do need it, it's best to be prepared.",
      "speakerIds": [
        "tommi-hovi"
      ]
    },
    {
      "id": "sessionize-127760",
      "title": "How versatile Microsoft Defender for Cloud is in 2025?",
      "abstract": "Already since way back in the days when it was called Azure Security Center we've seen its security recommendations, secure scores, inventory, regulatory compliance policies and we might have even seen some security alerts, if we were \"lucky\". And for most this image seems to have stuck in mind. But Microsoft has poured millions into the development of their security stack over the last 5 years and Defender for Cloud (as it is today called) has also learned a lot of new tricks.\nIn this session I'm going to uncover the robustness of Defender for Cloud in 2025. You can expect to gain overall understanding of how sneaky good Microsoft Defender for Cloud (MDC) is and how you can even use it to secure your digital non-Azure assets via its multi-cloud support. We'll cover following features and scenarios:\n- Securing non-Azure workloads\n- Proactive hunting of misconfigurations with Cloud Security Explorer\n- Remediation handling using Governance Rules\n- Integration to Microsoft Purview\n- Securing Azure Repos with DevOps Security\n- Cloud Security Posture Management\n- Cloud Workload Protection's today\nThis session does not dive deep into the code editor or command line, but rather explains how many different tricks MDC has up its sleeve and how you can benefit from them!",
      "speakerIds": [
        "tommi-hovi"
      ]
    },
    {
      "id": "sessionize-137420",
      "title": "Preparing Your Microsoft Tenant for Emerging Threats and Trends",
      "abstract": "The threat landscape is accelerating — and Microsoft cloud environments are squarely in the crosshairs. In this session, we’ll take a strategic and tactical look at how identity-based threats have evolved in the public cloud, what defenders are facing today, and where the risks are shifting next.\nWe’ll explore current and emerging trends such as large-scale token theft, MFA fatigue, and consent phishing — and examine how developments in AI, automation, and cybercrime-as-a-service are reshaping attacker capabilities.\nLooking ahead to 2026, we’ll identify key focus areas for defenders: which risks deserve priority, where budgets should be aligned, and how to think tactically about preparing your Microsoft tenant to meet the next wave of cyber threats.\nKey takeaways:\n• A strategic view of current and emerging threats in Microsoft cloud\n• Attack trends shaping 2025 and beyond (AI, Data, Identity...)\n• Tactical insights on where security leaders should focus next\nThis session is designed for cloud architects, security strategists, and IT leaders seeking to stay ahead of evolving threats — without getting lost in low-level technical detail.",
      "speakerIds": [
        "tommi-hovi"
      ]
    },
    {
      "id": "sessionize-137425",
      "title": "Fighting Identity-Based Attacks in Entra ID for Defenders",
      "abstract": "Identity is the primary perimeter to secure — and also the most targeted in public cloud. In this session, we’ll walk through today’s most common identity-based attacks in Microsoft Entra, including token theft, consent phishing, credential stuffing, and Business Email Compromise (BEC).\nUsing real-world scenarios, we’ll explore how to defend against these threats using Microsoft 365 Business Premium, E3, and E5 — with a candid look at what’s actually possible across different licensing tiers. We’ll also reflect on how cybercrime has evolved into a professionalized industry, with identity now serving as the primary entry point for attackers.\nWith over 345 million password-based attacks occurring daily and BEC losses in the billions, it’s no longer a matter of if you’ll be targeted — but when.\nWhat you’ll learn:\n• Key attack techniques targeting identities in Microsoft Entra\n• How Microsoft 365 licensing impacts your defense strategy\n• Actionable protection tactics for different business tiers\nThis session is ideal for IT admins, cloud architects, and security defenders looking to strengthen their identity protection strategy with real-life practicality.",
      "speakerIds": [
        "tommi-hovi"
      ]
    },
    {
      "id": "sessionize-30635",
      "title": "Playing the game with Azure Cognitive Services",
      "abstract": "Azure Cognitive Services offers the most comprehensive portfolio in the market for developers who want to embed AI capabilities into their applications and platforms.\nDuring this session, Pieter will give you an overview into the Azure Cognitive Services offering. Armed with machine learning algorithms, he will show how AI can help you reach some hard to achieve goals and how to integrate them within your applications.\nThis session covers an extensive demo using cognitive services in combination with custom vision to recognize the blackjack value of a set of card.",
      "speakerIds": [
        "pieter-vandenheede"
      ]
    },
    {
      "id": "sessionize-51570",
      "title": "Enable warp speed on your .NET APIs",
      "abstract": "In a fast, digital world, data should be served at the speed of light... some however are stuck at impulse speed.... Do you own or operate a .NET API that is not performing as expected? Learn how to boost the performance!\nIn this session, Pieter brings a real-life example of an underperforming .NET API, He will go over a few steps and show you what you can do to improve and measure the performance of your .NET APIs using load/performance testing and Azure tooling.\nPieter will use tools like Azure App services & autoscaling, k6, Azure Redis Cache, Azure API Management, JSON serializers and a touch of profiling to find the bottlenecks and increase performance.\nExpect demos and lessons learned on how we boosted performance and utilization of one of our APIs for one of our customers.",
      "speakerIds": [
        "pieter-vandenheede"
      ]
    },
    {
      "id": "sessionize-100306",
      "title": "Help! As a .NET developer, I'm afraid of drowning in that big lake of data stuff",
      "abstract": "In today's data-driven world, .NET developers are increasingly required to collaborate with data engineers and analysts to build robust and efficient data-driven solutions. Having no data affinity, I wanted to break out of my comfort zone and explore this data thing. However, things got pretty confusing, pretty soon.\nShould I focus on data warehouses, lakes, swamps, or lakehouses? Is ELT a typo? Should I learn Greek first to understand these delta, kappa, and lambda architectures? And what should I do to get a bronze, silver, or gold data medal?\nThis session will be packed with information I wish I had when starting my data journey. You will also get practical guidance on how to implement your data solutions using Azure PaaS and Data components.\nBy the end of this session, you will be able to engage in meaningful discussions with other data professionals without feeling like an imposter.",
      "speakerIds": [
        "ruben-delange"
      ]
    },
    {
      "id": "sessionize-96415",
      "title": "Creating the Spider in a Web of Azure PaaS Integrations",
      "abstract": "In the world of globally distributed data and API platforms, the broker takes on the role of a capeless hero, serving as the spider in a web of integrations. With its superpowers of intelligent routing, data transformation logic, and orchestration capabilities, the broker enables seamless communication and central management.\nHowever, Uncle Ben said that with great power comes great responsibility. As the single point of failure, the broker must be performant, robust, and resilient. Unfortunately, these crucial concepts are often overlooked, allowing the bad guys to prevail.\nJoin Ruben as he shares key findings and concepts for building a resilient data and API platform on Azure PaaS services, derived from a real-life use case. We will dive into the technical details and explore the essential Azure services necessary for any successful platform.\nBy the end of this session, whether you're a beginner or an experienced professional, you will be stuffed with practical guidelines and insights to build and tweak your next 'superhero' cloud integration platform. Webs up!",
      "speakerIds": [
        "ruben-delange"
      ]
    },
    {
      "id": "sessionize-39020",
      "title": "API Management in a hybrid world - A secure story from the field",
      "abstract": "API Management is the cornerstone of modern application integration. The key business driver for introducing API Management is the need to provide secure and scalable access to internal APIs. This access can be granted to internal, but often also to 3rd-party applications and users. Moreover, these internal APIs are likely to still be hosted on an on-premises or private cloud infrastructure.\nIn this session we will take a closer look at how you can securely expose your business critical, internal APIs to the outside world via a hybrid cloud setup. Azure API Management will obviously be our key component, but we will need to introduce other Azure PaaS components to cover both network related and application related security needs.",
      "speakerIds": [
        "ruben-delange"
      ]
    },
    {
      "id": "sessionize-52184",
      "title": "Jumping straight into code when building your Azure PaaS product… will it fizz or will it bang?",
      "abstract": "About a year ago we felt the urge to build a product to make our Zure booth at the CloudBrew conference stand out. Not much later, we came up with the idea of building Zpeedy, our own IoT-powered racetrack. We dove right into different technical scenarios as Azure PaaS fans, but it soon became clear that we needed some business context to keep us on track during our journey…\nThis session will sum up how we went through the various product development stages. You'll get some tips and tricks on how to do just-enough-analysis, and we'll look at which Azure PaaS components we used, why we chose them, and what lessons we learned along the way.\nCome join us if you want to find out what's under the hood of Zpeedy or if you just want to race your heart out!",
      "speakerIds": [
        "ruben-delange"
      ]
    },
    {
      "id": "sessionize-161941",
      "title": "From Vibecoding to Team Coding",
      "abstract": "Many of us developers have tried vibecoding or spec-driven development. Some of us think it is a real delivery boost, others that the quality is not there yet. Some have tried SDD frameworks, such as Spec-Kit or Kiro, while others play around with simpler PRD.md files. Some swear on the process of research-plan-implement, with a sprinkling of git work-trees and parallelization via subagents, while others think that AI is more limited and best suited to learning, documenting, planning and maybe generating tests.\nI don't know who is right, but I know that in a team of people, not everyone can have a different approach. This talk is about my experiences in how a team could approach AI-assisted development. After this talk, you'll have the necessary tools to start figuring out if AI is something that might boost your team's delivery.\nThe talk is not technical per se, more about the tooling, process, and frameworks such as SDD, context, and harness engineering.",
      "speakerIds": [
        "sakari-nahi"
      ]
    },
    {
      "id": "sessionize-158597",
      "title": "Time to supercharge your SecOps with AI!",
      "abstract": "We utilize more and more AI in our daily work every day - whether companies want it or not. This means that your security operations can't be left behind, but should also adopt AI to upgrade their capabilities to 2025!\nIn this session, we'll go through tangible examples that you can implement to boost your security operations, cut down on MTTR (Mean-Time-To-Response) and save time from your already overwhelmed administrators.\nLearn how you can utilize Azure OpenAI / AI Foundry, Logic Apps and many other technologies to take your SecOps processes from 2015 to 2025!",
      "speakerIds": [
        "miska-kyto"
      ]
    },
    {
      "id": "sessionize-158596",
      "title": "AI compromise in action: Inside the world's first Copilot vulnerability",
      "abstract": "Your company just got hacked through your M365 Copilot, and you didn't notice a thing.\nThis was the reality with Echoleak, the first real-world vulnerability discovered in Microsoft 365 Copilot. A true zero-click attack that could lead to your sensitive data being handed over to an attacker.\nIn this session, we take a deep dive into how EchoLeak works, what are the technical vulnerabilities it highlights in AI systems, and the techical controls available to mitigate these risks. You'll learn how AI systems are vulnerable to attack vectors that completely bypass traditional security thinking and discover the defenses you can build into your own AI solutions.",
      "speakerIds": [
        "miska-kyto"
      ]
    },
    {
      "id": "sessionize-162047",
      "title": "terraform in practice for modern cloud infrastructure",
      "abstract": "This full day workshop is a hands on session focused on building and operating cloud infrastructure with Terraform. You work with Microsoft Azure as the main platform, while also using cloud agnostic services such as SQL, GitHub, and Cloudflare. The goal is to apply Terraform in setups that are close to real production environments.\nWe start with the Terraform and OpenTofu basics to align everyone. Providers, resources, state, and modules are introduced and used immediately. The workshop also compares Terraform with Azure native tooling such as Bicep, and explains when to use which approach in practice.\nHands on labs are combined with short theory blocks throughout the day. You work with CI/CD pipelines, GitOps workflows, security controls, and platform engineering patterns. Topics include environment separation, secrets management, policy application, and keeping infrastructure changes controlled and repeatable.\nAt the end of the workshop, you can use Terraform to build and run production ready cloud infrastructure. You leave with working examples, reusable patterns, and practical experience you can apply in your own projects.",
      "speakerIds": [
        "chris-van-sluijsveld"
      ]
    }
  ]
}
